///////////////////////////////////////////////////////////////////////////////////
//Модуль - Общего назначения Клиент Сервер
///////////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////////
#Область ОбщиеПроцедурыФункции

// Функция - Получить структуру ALPHABET
// 
// Возвращаемое значение:
// Структура  - Ключи струкруры: Строка, Массив
//
Функция ПолучитьСтруктуруALPHABET() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Строка", 
		"123456789ABCDEFGHJKLMNPQRSTUVWXYZabcdefghijkmnopqrstuvwxyz");
	
	ALPHABET_СРазделителями = "1,2,3,4,5,6,7,8,9,A,B,C,D,E,F,G,H,J,K,"+
		"L,M,N,P,Q,R,S,T,U,V,W,X,Y,Z,a,b,c,d,e,f,g,h,i,j,k,m,n,o,p,q,r,s,t,u,v,w,x,y,z";
	
	Результат.Вставить("Массив", РазложитьСтрокуВМассив(ALPHABET_СРазделителями));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

///////////////////////////////////////////////////////////////////////////////////
#Область Массивы

// Функция - Разложить строку в массив
//
// Параметры:
//  Стр			 - Строка 		 - Строка с разделителями 
//  Разделитель	 - Разделитель	 - Разделитель подстрок
// 
// Возвращаемое значение:
// Массив  -  Массив подстрок
//
Функция РазложитьСтрокуВМассив(Знач Стр, Разделитель = ",") Экспорт
    
    Результат = Новый Массив;
    
    Строки = СтрЗаменить(Стр, Разделитель, Символы.ПС);
    
	Для Индекс = 1 По СтрЧислоСтрок(Строки) Цикл
		
        Результат.Добавить(СтрПолучитьСтроку(Строки, Индекс));
		
    КонецЦикла;
    
    Возврат Результат;
  
КонецФункции

// Функция - Разложить массив в строку
//
// Параметры:
//  Массив		 - Массив - Элементы которого разложим в строку
//  Разделитель	 - Строка - Разделитель элементов массива
// 
// Возвращаемое значение:
//  Строка - Строка из элементов массива, с раздилителями
//
Функция РазложитьМассивВСтроку(Знач Массив, Разделитель = ",") Экспорт
	
	СтрокаРезультат = "";
	
	Для Каждого ЭлементМассива Из Массив цикл
		
		СтрокаРезультат = СтрокаРезультат + СокрЛП(Строка(ЭлементМассива)) + Разделитель;
		
	КонецЦикла;
	
	СтрокаРезультат = Лев(СтрокаРезультат, СтрДлина(СтрокаРезультат) - 1);
	
	Возврат СтрокаРезультат;
	
КонецФункции

// Функция - Развернуть массив
//
// Параметры:
//  пМассив	 - Массив - Массив который необходимо развернуть
// 
// Возвращаемое значение:
// Массив - Массив с обратной последовательностью элементов
//
Функция РазвернутьМассив(Знач пМассив) Экспорт
	
	рМассив = Новый Массив;
	
	сч = пМассив.Количество() - 1;
	
	Пока сч > -1 Цикл 
		
		рМассив.Добавить(пМассив[сч]);
		
		сч = сч - 1;
		
	КонецЦикла;
	
	Возврат рМассив;
	
КонецФункции

#КонецОбласти
///////////////////////////////////////////////////////////////////////////////////
